0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    Inlets
    {
        type            fixedValue;
        value           uniform (0.05 0 0);
    }
    Outlets
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    HPOutlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    PSInlet
    {
        type            fixedValue;
        value           uniform (0.05 0 0);
    }
}


// ************************************************************************* //
