constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       50920;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20800;
        startFace       52920;
    }
    Inlets
    {
        type            patch;
        nFaces          40;
        startFace       73720;
    }
    Outlets
    {
        type            patch;
        nFaces          40;
        startFace       73760;
    }
    HPOutlet
    {
        type            patch;
        nFaces          40;
        startFace       73800;
    }
    PSInlet
    {
        type            patch;
        nFaces          40;
        startFace       73840;
    }
)

// ************************************************************************* //
