system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)                  // 0
    (0.012 0 0)              // 1
    (0.012 0.004 0)          // 2
    (0 0.004 0)              // 3
    (0 0 0.001)              // 4
    (0.012 0 0.001)          // 5
    (0.012 0.004 0.001)      // 6
    (0 0.004 0.001)          // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (240 80 2) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }
    Inlets
    {
        type patch;
        faces
        (
            (4 7 3 0)
        );
    }
    Outlets
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
